Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image (InputLayer)           [(None, 300, 50, 1)]      0         
_________________________________________________________________
Conv1 (Conv2D)               (None, 300, 50, 32)       320       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 150, 25, 32)       0         
_________________________________________________________________
Conv2 (Conv2D)               (None, 150, 25, 64)       18496     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 75, 12, 64)        0         
_________________________________________________________________
reshape (Reshape)            (None, 75, 768)           0         
_________________________________________________________________
dense1 (Dense)               (None, 75, 64)            49216     
_________________________________________________________________
dropout (Dropout)            (None, 75, 64)            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 75, 256)           197632    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 75, 128)           164352    
_________________________________________________________________
dense2 (Dense)               (None, 75, 30)            3870      
=================================================================
Total params: 433,886
Trainable params: 433,886
Non-trainable params: 0
_________________________________________________________________
